I'm unable to reproduce this bug. Here's my configuration:

```hcl
provider "aws" {
  region = "us-east-1"
}

output "key" {
  value = aws_kms_key.key.id
}

resource "aws_kms_key" "key" {
  description             = "Test"
  is_enabled              = true
  deletion_window_in_days = 7
} 
```

And the result:

```shellsession
$ terraform apply -auto-approve

Terraform used the selected providers to generate the following execution plan. Resource actions are
indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_kms_key.key will be created
  + resource "aws_kms_key" "key" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "Test"
      + enable_key_rotation                = false
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + key = (known after apply)
aws_kms_key.key: Creating...
aws_kms_key.key: Creation complete after 1s [id=ae95fdb1-4111-495c-8ef0-45fb9083d39e]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

Outputs:

key = "ae95fdb1-4111-495c-8ef0-45fb9083d39e"
$ terraform output
key = "ae95fdb1-4111-495c-8ef0-45fb9083d39e"
```

Are you seeing different behaviour even with this reduced configuration? If not, can you find a minimal reproduction so that I can see the issue?

Can you share (a redacted version of) the output of this command?

```sh
jq .outputs terraform.tfstate
```